{
  "format": "graph-model",
  "generatedBy": "TensorFlow.js",
  "convertedBy": "TensorFlow.js Converter",
  "signature": {
    "inputs": {
      "image": {
        "name": "serving_default_image:0",
        "dtype": "DT_FLOAT32",
        "shape": [-1, 224, 224, 3]
      }
    },
    "outputs": {
      "output": {
        "name": "StatefulPartitionedCall:0",
        "dtype": "DT_FLOAT32",
        "shape": [-1, 6]
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "image",
        "op": "Placeholder",
        "attr": {
          "dtype": {"type": "DT_FLOAT32"},
          "shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}
        }
      },
      {
        "name": "conv1",
        "op": "Conv2D",
        "input": ["image"],
        "attr": {
          "T": {"type": "DT_FLOAT32"},
          "padding": "SAME",
          "strides": {"list": {"i": [1, 2, 2, 1]}},
          "data_format": "NHWC",
          "dilations": {"list": {"i": [1, 1, 1, 1]}},
          "ksize": {"list": {"i": [1, 5, 5, 1]}},
          "filters": {"i": 32}
        }
      },
      {
        "name": "relu1",
        "op": "Relu",
        "input": ["conv1"]
      },
      {
        "name": "pool1",
        "op": "MaxPool",
        "input": ["relu1"],
        "attr": {
          "padding": "SAME",
          "strides": {"list": {"i": [1, 2, 2, 1]}},
          "data_format": "NHWC",
          "ksize": {"list": {"i": [1, 2, 2, 1]}}
        }
      },
      {
        "name": "conv2",
        "op": "Conv2D",
        "input": ["pool1"],
        "attr": {
          "T": {"type": "DT_FLOAT32"},
          "padding": "SAME",
          "strides": {"list": {"i": [1, 2, 2, 1]}},
          "data_format": "NHWC",
          "dilations": {"list": {"i": [1, 1, 1, 1]}},
          "ksize": {"list": {"i": [1, 5, 5, 1]}},
          "filters": {"i": 64}
        }
      },
      {
        "name": "relu2",
        "op": "Relu",
        "input": ["conv2"]
      },
      {
        "name": "pool2",
        "op": "MaxPool",
        "input": ["relu2"],
        "attr": {
          "padding": "SAME",
          "strides": {"list": {"i": [1, 2, 2, 1]}},
          "data_format": "NHWC",
          "ksize": {"list": {"i": [1, 2, 2, 1]}}
        }
      },
      {
        "name": "flatten",
        "op": "Reshape",
        "input": ["pool2"],
        "attr": {
          "T": {"type": "DT_FLOAT32"},
          "shape": {"dim": [{"size": "-1"}, {"size": "36864"}]}
        }
      },
      {
        "name": "dense1",
        "op": "MatMul",
        "input": ["flatten"],
        "attr": {
          "T": {"type": "DT_FLOAT32"},
          "transpose_a": false,
          "transpose_b": true
        }
      },
      {
        "name": "relu3",
        "op": "Relu",
        "input": ["dense1"]
      },
      {
        "name": "dropout",
        "op": "Identity",
        "input": ["relu3"]
      },
      {
        "name": "dense2",
        "op": "MatMul",
        "input": ["dropout"],
        "attr": {
          "T": {"type": "DT_FLOAT32"},
          "transpose_a": false,
          "transpose_b": true
        }
      },
      {
        "name": "output",
        "op": "Identity",
        "input": ["dense2"]
      }
    ],
    "library": {}
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": [
        {
          "name": "conv1/kernel",
          "shape": [5, 5, 3, 32],
          "dtype": "float32"
        },
        {
          "name": "conv1/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "conv2/kernel",
          "shape": [5, 5, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "conv2/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "dense1/kernel",
          "shape": [36864, 128],
          "dtype": "float32"
        },
        {
          "name": "dense1/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "dense2/kernel",
          "shape": [128, 6],
          "dtype": "float32"
        },
        {
          "name": "dense2/bias",
          "shape": [6],
          "dtype": "float32"
        }
      ]
    }
  ]
}
